#ifndef ADC_H_
#define ADC_H_

//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//
#define UP		0x1
#define PUSH 	0x2
#define	LEFT	0x3
#define RIGHT	0x4
#define DOWN	0x5

//====================================//
// グローバル変数の宣言
//====================================//
extern uint16_t analog[14];
//====================================//
// プロトタイプ宣言
//====================================//
uint8_t getSWrotary();
uint8_t getSWtact();

#endif // ADC_H_
