#ifndef COURSEANALYSIS_H_
#define COURSEANALYSIS_H_
//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//
#define DELTATIME 0.01F
//====================================//
// グローバル変数の宣言
//====================================//
extern float CurvatureRadius;
//====================================//
// プロトタイプ宣言
//====================================//
float calcCurvatureRadius(float velo, float angvelo);

#endif // COURSEANALYSIS_H_
