#ifndef LINESENSOR_H_
#define LINESENSOR_H_

//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//


//====================================//
// グローバル変数の宣言
//====================================//
extern uint16_t     analogVal[14];         // ADC結果格納配列
extern uint16_t		lsensor[12];

//====================================//
// プロトタイプ宣言
//====================================//
void getLineSensor(void);

#endif // LINESENSOR_H_
