#ifndef TIMER_H_
#define TIMER_H_

//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//

//====================================//
// グローバル変数の宣言
//====================================//
extern uint16_t		cntSW;
extern uint32_t     cntRun;
extern uint32_t     cntLog;
extern uint16_t     cntEmc1;

//====================================//
// プロトタイプ宣言
//====================================//
void motorPwmOut(int16_t pwmL, int16_t pwmR);

#endif // TIMER_H_
