//====================================//
// インクルード
//====================================//
#include "adc.h"
//====================================//
// グローバル変数の宣言
//====================================//
uint16_t analog[14];

/////////////////////////////////////////////////////////////////////
// モジュール名 HAL_ADC_ConvCpltCallback
// 処理概要  AD変換後の割り込み
// 引数     なし
// 戻り値    なしト
/////////////////////////////////////////////////////////////////////
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* AdcHandle) {

}
/////////////////////////////////////////////////////////////////////
// モジュール名 getSWrotary
// 処理概要  ロータリスイッチのアナログ入力から2進数への変換
// 引数     なし
// 戻り値    ロータリスイッチのカウント
/////////////////////////////////////////////////////////////////////
uint8_t getSWrotary() {
	uint16_t ad = analog[13];
	uint8_t ret = 0;
	if ( ad > 3900 ) ret = 0x0;
	if ( ad < 3671 && ad > 3663 ) ret = 0x1;
	if ( ad < 2774 && ad > 2756 ) ret = 0x2;
	if ( ad < 2572 && ad > 2553 ) ret = 0x3;
	if ( ad < 2340 && ad > 2320 ) ret = 0x4;
	if ( ad < 2195 && ad > 2174 ) ret = 0x5;
	if ( ad < 1839 && ad > 1819 ) ret = 0x6;
	if ( ad < 1748 && ad > 1728 ) ret = 0x7;
	if ( ad < 1606 && ad > 1586 ) ret = 0x8;
	if ( ad < 1536 && ad > 1517 ) ret = 0x9;
	if ( ad < 1353 && ad > 1335 ) ret = 0xa;
	if ( ad < 1303 && ad > 1285 ) ret = 0xb;
	if ( ad < 1241 && ad > 1223 ) ret = 0xc;
	if ( ad < 1199 && ad > 1182 ) ret = 0xd;
	if ( ad < 1084 && ad > 1068 ) ret = 0xe;
	if ( ad < 1052 && ad > 1036 ) ret = 0xf;

	return ret;
}
/////////////////////////////////////////////////////////////////////
// モジュール名 getSWtact
// 処理概要  5方向タクトスイッチのアナログ入力から5方向の入力に変換
// 引数      なし
// 戻り値     スイッチの方向
/////////////////////////////////////////////////////////////////////
uint8_t getSWtact() {
	uint16_t ad = analog[12];
	uint8_t ret = 0;

	if ( ad > 3900 ) ret = 0x0;
	if ( ad < 10 && ad >= 0 ) 		ret = UP;
	if ( ad < 1240 && ad > 1206 ) 	ret = PUSH;
	if ( ad < 2191 && ad > 2150 ) 	ret = LEFT;
	if ( ad < 2838 && ad > 2803 ) 	ret = RIGHT;
	if ( ad < 3341 && ad > 3316 ) 	ret = DOWN;


	return ret;
}
