//====================================//
// インクルード
//====================================//
#include "adc.h"
//====================================//
// グローバル変数の宣言
//====================================//
uint16_t analog[14];

/////////////////////////////////////////////////////////////////////
// モジュール名 HAL_ADC_ConvCpltCallback
// 処理概要  AD変換後の割り込み
// 引数     なし
// 戻り値    なしト
/////////////////////////////////////////////////////////////////////
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* AdcHandle) {

}
/////////////////////////////////////////////////////////////////////
// モジュール名 getSWrotary
// 処理概要  ロータリスイッチのアナログ入力から2進数への変換
// 引数     なし
// 戻り値    ロータリスイッチのカウント
/////////////////////////////////////////////////////////////////////
uint8_t getSWrotary() {
	uint16_t ad = analog[13];
	uint8_t ret = 0;
	if ( ad > 3900 ) ret = 0x0;
	if ( ad < 3681 && ad > 3653 ) ret = 0x1;
	if ( ad < 2784 && ad > 2746 ) ret = 0x2;
	if ( ad < 2582 && ad > 2543 ) ret = 0x3;
	if ( ad < 2350 && ad > 2310 ) ret = 0x4;
	if ( ad < 2205 && ad > 2164 ) ret = 0x5;
	if ( ad < 1849 && ad > 1809 ) ret = 0x6;
	if ( ad < 1758 && ad > 1718 ) ret = 0x7;
	if ( ad < 1616 && ad > 1576 ) ret = 0x8;
	if ( ad < 1546 && ad > 1507 ) ret = 0x9;
	if ( ad < 1363 && ad > 1325 ) ret = 0xa;
	if ( ad < 1313 && ad > 1275 ) ret = 0xb;
	if ( ad < 1251 && ad > 1213 ) ret = 0xc;
	if ( ad < 1209 && ad > 1172 ) ret = 0xd;
	if ( ad < 1094 && ad > 1058 ) ret = 0xe;
	if ( ad < 1057 && ad > 1026 ) ret = 0xf;

	return ret;
}
/////////////////////////////////////////////////////////////////////
// モジュール名 getSWtact
// 処理概要  5方向タクトスイッチのアナログ入力から5方向の入力に変換
// 引数      なし
// 戻り値     スイッチの方向
/////////////////////////////////////////////////////////////////////
uint8_t getSWtact() {
	uint16_t ad = analog[12];
	uint8_t ret = 0;

	if ( ad > 3900 ) ret = 0x0;
	if ( ad < 50 && ad >= 0 ) 		ret = UP;
	if ( ad < 1340 && ad > 1106 ) 	ret = PUSH;
	if ( ad < 2291 && ad > 2050 ) 	ret = LEFT;
	if ( ad < 2938 && ad > 2703 ) 	ret = RIGHT;
	if ( ad < 3441 && ad > 3216 ) 	ret = DOWN;


	return ret;
}
