//====================================//
// インクルード
//====================================//
#include "courseAnalysis.h"
//====================================//
// グローバル変数の宣
//====================================//
float CurvatureRadius = 0;
/////////////////////////////////////////////////////////////////////
// モジュール名 calcCurvatureRadius
// 処理概要     曲率半径の計算
// 引数         velo: エンコーダカウント angvelo: 角速度[rad/s]
// 戻り値       曲率半径[mm]
/////////////////////////////////////////////////////////////////////
float calcCurvatureRadius(float velo, float angvelo) {
    float dl, drad, ret;
    dl = velo / PALSE_MILLIMETER * 1000 * DELTATIME; // [pilse] → [mm/s] → [mm] 
    drad = angvelo * DELTATIME;            // [rad/s] → [rad]
    ret = dl / drad;
    if (fabs(ret) > 1500.0F) {
        ret = 10000.0;
    }

    return ret;
}
/////////////////////////////////////////////////////////////////////
// モジュール名 calcCurvatureRadius
// 処理概要     曲率半径の計算
// 引数         velo: エンコーダカウント angvelo: 角速度[rad/s]
// 戻り値       曲率半径[mm]
/////////////////////////////////////////////////////////////////////