//====================================//
// インクルード
//====================================//
#include "lineSensor.h"
//====================================//
// グローバル変数の宣言
//====================================//

// ラインセンサ関連
uint32_t		lsensorInt[12] = {0};	// ラインセンサのAD値積算用
uint16_t		lsensor[12] = {0};	// ラインセンサのAD値積算用

uint16_t		cntls = 0;		// ラインセンサの積算回数カウント用
/////////////////////////////////////////////////////////////////////
// モジュール名 getLineSensor
// 処理概要  	ラインセンサのAD値を取得し、平均値を計算する
// 引数     	なし
// 戻り値    	なし
/////////////////////////////////////////////////////////////////////
void getLineSensor(void) {
	uint8_t i;
	cntls++;
	for ( i=0;i<=11;i++) {
		lsensorInt[i] += analogVal[i];
	}

	if (cntls > 10) {
		for ( i=0;i<=11;i++) {
			lsensor[i] = lsensorInt[i]/10;
			lsensorInt[i] = 0;
		}
		cntls = 0;
	}
}